Update plog from upstream
